//Выполнил: Артем Анатольевич Авдеев (know as Survivor of the SAO & Master of the Geass)
//___________________________________________________________________________________________________________________________________
// Задача 68: Напишите программу вычисления функции Аккермана с помощью рекурсии. Даны два неотрицательных числа m и n.
// m = 2, n = 3 -> A(m,n) = 29
//===================================================================================================================================
//Решение:
//-----------------------------------------------------------------------------------------------------------------------------------
int GDS(string txt)    // метод преобразует строку в число, при этом выводит задаваемый комментарий на консоль
{
    System.Console.Write(txt);  //вывод комментария на консоль
    return Convert.ToInt32(Console.ReadLine()); //вызов метода преобразования строки/целое число
}
//-----------------------------------------------------------------------------------------------------------------------------------
int AkkermanFunction(int m, int n)//метод возращающий сумму натуральных чисел, лежащих в задаваемом диапазоне 
{
    if (m == 0) { return n + 1; }
    if (m > 0 && n==0) { return AkkermanFunction(m-1,1); }
    if (m > 0 && n>0) { return AkkermanFunction(m-1,AkkermanFunction(m,n-1)); }
    return 0;
}
//-----------------------------------------------------------------------------------------------------------------------------------
void DisplayAll()
{
    System.Console.WriteLine();
    System.Console.WriteLine($"Значение функции Аккермана: {AkkermanFunction(GDS("Введите аргумент `m`: "), GDS("Введите аргумент `n`: "))}");
    System.Console.WriteLine();
}
//-----------------------------------------------------------------------------------------------------------------------------------

DisplayAll();