//by Survivor of the SAO

//Задать массив из N элементов, заполненный случайными числами [-9,9]. Найти сумму отрицатильных и положительных элементов

//--------------------------------------------------------------------------------------------------------------------------
int GetDigitFromString(string txt)    // метод преобразует строку в число, при этом выводит задаваемый комментарий на консоль
{
System.Console.Write(txt);  //вывод комментария на консоль
return Convert.ToInt32(Console.ReadLine()); //вызов метода преобразования строки/целое число
}
//-----------------------------------------------------------------------------------------------------------------------------------
int [] CreateAnArrayOfGivenLength (int num) //метод создания массива нужной длины (из целого числа)
{
    var variableLengthArray = new int [num];    //объявление массива и определение его длины
    return variableLengthArray;
}
//-----------------------------------------------------------------------------------------------------------------------------------
int [] GeneratingRandomValuesFillingArray(int sizeArray,int lowRND,int hightRND)    //объединяющий метод - создания массива по условию задачи
{
    var varArray = CreateAnArrayOfGivenLength(sizeArray);   //создание массива заданной длины
    var randomValue = new Random(); //объявление рандомной переменной

    for (int i=0; i<varArray.Length; i++)            //заполнение массива случайными значениями
        {
            varArray[i]=randomValue.Next(lowRND,hightRND); //внимани 2-не входит в границу правого диапазона (n-1)
        }
    return varArray;
}
//-----------------------------------------------------------------------------------------------------------------------------------
void DisplayArray (int [] myArray)  //метод выводящий содержимое сгенерированного массива
{
    System.Console.WriteLine($"Массив:[{string.Join(";",myArray)}]"); //крутой метод вывода массива. параметр1-сепаратор, пар2-сам массив
}
//-----------------------------------------------------------------------------------------------------------------------------------
int PositiveSum(int [] arrayX)   //возращает сумму положительных чисел
{
    int positiveSum=0;
    for(int i=0; i<arrayX.Length; i++)
    {
        if (arrayX[i]>=0){positiveSum=positiveSum+arrayX[i];}
    }
    return positiveSum;
}
//-----------------------------------------------------------------------------------------------------------------------------------
int NegativeSum(int [] arrayY)   //возращает сумму отрицательных чисел
{
    int negativeSum=0;
    for(int j=0; j<arrayY.Length; j++)
    {
        if (arrayY[j]<0){negativeSum=negativeSum+arrayY[j];}
    }
    return negativeSum;
}
//-----------------------------------------------------------------------------------------------------------------------------------
void DisplayAll()   //демонстрация всех условий и значений
{
    int [] thisArray=GeneratingRandomValuesFillingArray(GetDigitFromString("Введите длину массива:"),GetDigitFromString("Введите нижний уровень:"),GetDigitFromString("Введите верхний уровень:"));
    DisplayArray(thisArray);
    System.Console.WriteLine($"Сумма положительных значений: {PositiveSum(thisArray)}; Сумма отрицательных значений: {NegativeSum(thisArray)}");
}
//-----------------------------------------------------------------------------------------------------------------------------------
DisplayAll();