//Выполнил: Артем Анатольевич Авдеев (know as Survivor of the SAO & Master of the Geass)
//___________________________________________________________________________________________________________________________________
// Задача 52. Задайте двумерный массив из целых чисел. Найдите среднее арифметическое элементов в каждом столбце.
//===================================================================================================================================
// Решение:
//-----------------------------------------------------------------------------------------------------------------------------------
int GetDigitString(string txt)    // метод преобразует строку в число, при этом выводит задаваемый комментарий на консоль
{
    System.Console.Write(txt);  //вывод комментария на консоль
    return Convert.ToInt32(Console.ReadLine()); //вызов метода преобразования строки/целое число
}
//-----------------------------------------------------------------------------------------------------------------------------------
int[,] GnrtRndVlsFilling2DArray(int i_sizeArray, int j_sizeArray, int lowRND, int hightRND)    //метод создания массива по условию задачи
{
    var varArray = new int[i_sizeArray, j_sizeArray];   //создание массива заданной длины
    var randomValue = new Random(); //объявление рандомной переменной

    for (int i = 0; i < varArray.GetLength(0); i++) //GetLength(0)-метод, возращающий длину массива в первом("0") пространстве("i")
    {
        for (int j = 0; j < varArray.GetLength(1); j++)    //GetLength(1)-метод,возращающий длину массива во втором("1")пространстве("j")
        {
            varArray[i, j] = randomValue.Next(lowRND, hightRND + 1); //внимани 2-не входит в границу правого диапазона (n-1)
        }
    }
    return varArray;
}
//-----------------------------------------------------------------------------------------------------------------------------------
double[] MeansAtCol(int[,] sourceArray)    //метод, возращающий решение задачи№52
{
    double[] meansArray = new double[sourceArray.GetLength(1)];
    for (int i = 0; i < sourceArray.GetLength(0); i++)//колонки
    {
        for (int j = 0; j < sourceArray.GetLength(1); j++)//строки
        {
            meansArray[j] += (sourceArray[i, j]);    //cуммирование значений строк в колонке 
        }
    }

    //получение среднего значения:
    for (int p = 0; p < sourceArray.GetLength(1); p++) { meansArray[p] = Math.Round((meansArray[p] / sourceArray.GetLength(0)), 1); }
    return meansArray;
}
//-----------------------------------------------------------------------------------------------------------------------------------
void Display2DArray(int[,] myArray)  //метод выводящий содержимое 2D массива в сторку
{
    System.Console.WriteLine();

    for (int i = 0; i < myArray.GetLength(0); i++) //GetLength(0)-метод, возращающий длину массива в первом("0") пространстве("i")
    {
        for (int j = 0; j < myArray.GetLength(1); j++)    //GetLength(1)-метод,возращающий длину массива во втором("1")пространстве("j")
        {
            System.Console.Write(myArray[i, j] + "\t"); //использование табуляции для выравнивания вывода -("\t")
        }

        System.Console.WriteLine(); //пустая строка позволяет вывести построчно 
    }
}
//-----------------------------------------------------------------------------------------------------------------------------------
void DisplayArray(double[] myArray)  //метод выводящий содержимое массива в сторку
{
    System.Console.WriteLine();

    for (int i = 0; i < myArray.Length; i++)
    {
        System.Console.Write(myArray[i] + "\t"); //использование табуляции для выравнивания вывода -("\t")
    }
}
//-----------------------------------------------------------------------------------------------------------------------------------
void DisplayAll()
{
    var tempArray = GnrtRndVlsFilling2DArray(GetDigitString("Кол-во строк: "), GetDigitString("Кол-во колонок: "), 0, 9);
    Display2DArray(tempArray);
    DisplayArray(MeansAtCol(tempArray));

}
//-----------------------------------------------------------------------------------------------------------------------------------
//===================================================================================================================================

DisplayAll();
