// Выполнил: Артем Авдеев (know as Survivor of the SAO)

// Задача 21
// Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 3D пространстве.
// A (3,6,8); B (2,1,-7), -> 15.84
// A (7,-5, 0); B (1,-1,9) -> 11.53
//-------------------------------------------------------------------------------------------------------------------------
//Решение:

int InCord(string txt)   // объявление метода ввода данных для определения координаткоординат
{
    System.Console.Write(txt);
    return Convert.ToInt32(Console.ReadLine());
}
//_____________________________________________________________________________________________________________________________

double PointsDistance3D(int ax, int ay, int az, int bx, int by, int bz) //объявление метода, возращающего расстояние между точками
{
    double ResultDistance=Math.Sqrt(Math.Pow(bx-ax,2)+Math.Pow(by-ay,2)+Math.Pow(bz-az,2));
    return ResultDistance;
}
//_____________________________________________________________________________________________________________________________

int xa=InCord("Веедите координту Х для точки А:");
int ya=InCord("Веедите координту Y для точки А:");
int za=InCord("Веедите координту Z для точки А:");

int xb=InCord("Веедите координту Х для точки B:");
int yb=InCord("Веедите координту Y для точки B:");
int zb=InCord("Веедите координту Z для точки А:");

System.Console.WriteLine($"Расстояние между точками A({xa};{ya};{za}) и B({xb};{yb};{zb}) в 3D составляет : {Math.Round(PointsDistance3D(xa,ya,za,xb,yb,zb),2)}");