//Выполнил: Артем Анатольевич Авдеев (know as Survivor of the SAO)
//___________________________________________________________________________________________________________________________________
// Задача 34: Задайте массив заполненный случайными положительными трёхзначными числами. Напишите программу, которая покажет количество
//  чётных чисел в массиве.
// [345, 897, 568, 234] -> 2
//-----------------------------------------------------------------------------------------------------------------------------------
//Решение:
//--------------------------------------------------------------------------------------------------------------------------
int GetDigitString(string txt)    // метод преобразует строку в число, при этом выводит задаваемый комментарий на консоль
{
System.Console.Write(txt);  //вывод комментария на консоль
return Convert.ToInt32(Console.ReadLine()); //вызов метода преобразования строки/целое число
}
//-----------------------------------------------------------------------------------------------------------------------------------
int [] GeneratingRandomValuesFillingArray(int sizeArray,int lowRND,int hightRND)    //объединяющий метод - создания массива по условию задачи
{
    var varArray = new int [sizeArray];   //создание массива заданной длины
    var randomValue = new Random(); //объявление рандомной переменной

    for (int i=0; i<varArray.Length; i++)            //заполнение массива случайными значениями
        {
            varArray[i]=randomValue.Next(lowRND,hightRND+1); //вниманиt!: значение правого диапазона невходит, поэтому:(n+1)
        }
    return varArray;
}
//-----------------------------------------------------------------------------------------------------------------------------------
int CountEvenNumbersByArray(int [] sourceArray)   //подсчет количества четных чисел в массиве
{
    int countEvenNumbers=0; //счетчик четных чисел в массиве
    for(int i=0; i<sourceArray.Length;i++)
    {
        if(sourceArray[i]%2==0){countEvenNumbers++;}
    }
    return countEvenNumbers;
}
//-----------------------------------------------------------------------------------------------------------------------------------
void DisplayArray (int [] myArray)  //метод выводящий содержимое массива в сторку
{
    System.Console.WriteLine($"[{string.Join(";",myArray)}]"); //крутой метод вывода массива. параметр1-сепаратор, пар2-сам массив
}
//-----------------------------------------------------------------------------------------------------------------------------------
void DisplayAll()   //демонстрация всех условий и значений
{
    int [] tempArray=GeneratingRandomValuesFillingArray(GetDigitString("Введите длину массива: "),100,999);
    
    DisplayArray(tempArray);
 
    System.Console.WriteLine($"Количество четных чисел в массиве: {CountEvenNumbersByArray(tempArray)}");
}
//-----------------------------------------------------------------------------------------------------------------------------------

DisplayAll();   //по сути - запуск проги