//by Survivor of the SAO & Master of the GEASS
//___________________________________________________________________________________________________________________________________
// РЕКУРСИЯ
//Задача 63: Задайте значение N. Напишите программу, которая выведет все натуральные числа в промежутке от 1 до N.
// N = 5 -> "1, 2, 3, 4, 5"
// N = 6 -> "1, 2, 3, 4, 5, 6"
//===================================================================================================================================
// Решение:
//-----------------------------------------------------------------------------------------------------------------------------------
//-----------------------------------------------------------------------------------------------------------------------------------
int GetDigitString(string txt)    // метод преобразует строку в число, при этом выводит задаваемый комментарий на консоль
{
    System.Console.Write(txt);  //вывод комментария на консоль
    return Convert.ToInt32(Console.ReadLine()); //вызов метода преобразования строки/целое число
}
//-----------------------------------------------------------------------------------------------------------------------------------
// void DisplayAllNaturalNumber(int Number)//метод сам вызывает себя
// {
//     if(Number<1){return;}
//     DisplayAllNaturalNumber(Number-1);
//     System.Console.Write(Number + "\t");
// }
//-----------------------------------------------------------------------------------------------------------------------------------
// DisplayAllNaturalNumber(GetDigitString("Введите число: "));
//===================================================================================================================================
// Задача 65: Задайте значения M и N. Напишите программу, которая выведет все натуральные числа в промежутке от M до N.
// M = 1; N = 5 -> "1, 2, 3, 4, 5"
// M = 4; N = 8 -> "4, 6, 7, 8
//___________________________________________________________________________________________________________________________________
// void DisplayDiapasomlNumber(int min, int max)//метод сам вызывает себя
// {
//     if(max<min){return;}
//     DisplayDiapasomlNumber(min,max-1);
//     System.Console.Write(max + "\t");
// }
//-----------------------------------------------------------------------------------------------------------------------------------
// DisplayDiapasomlNumber(GetDigitString("Введите min: "),GetDigitString("Введите max: "));
//===================================================================================================================================
// Задача 67: Напишите программу, которая будет принимать на вход число и возвращать сумму его цифр.
// 453 -> 12
// 45 -> 9
//___________________________________________________________________________________________________________________________________
// int PiphagorNumber(int source, int summaPif)//метод сам вызывает себя
// {
//     summaPif += source % 10;
//     if (source / 10 == 0) { return summaPif; }
//     return PiphagorNumber(source / 10, summaPif);
// }
// System.Console.WriteLine(PiphagorNumber(GetDigitString("Введите число: "),0)); //запуск метода и вывод его результата
// //-----------------------------------------------------------------------------------------------------------------------------------
// int PiphagorNumberVer2(int source)//второй вариант сам вызывает себя - это лучший, эталонный вариант
// {
//     if(source==0){return 0;}
//     return source%10+PiphagorNumberVer2(source/10);
// }
// System.Console.WriteLine(PiphagorNumberVer2(GetDigitString("Введите число: ")));//запуск метода и вывод его результата
//===================================================================================================================================
// Задача 69: Напишите программу, которая на вход принимает два числа A и B, и возводит число А в целую степень B с помощью рекурсии.
// A = 3; B = 5 -> 243 (3⁵)
// A = 2; B = 3 -> 8
//___________________________________________________________________________________________________________________________________
int StepenIsRecursie(int found, int stepen)//второй вариант сам вызывает себя - это лучший, эталонный вариант
{
    if(stepen==0){return 1;}
    return found*StepenIsRecursie(found,stepen-1);
}
System.Console.WriteLine(StepenIsRecursie(GetDigitString("Введите основание: "),GetDigitString("Введите степень: ")));//запуск метода и вывод его результата
//-----------------------------------------------------------------------------------------------------------------------------------
