//by Survivor of the SAO
//___________________________________________________________________________________________________________________________________
//Задача 40: проверка сторон треугольника (a+b>c)
//===================================================================================================================================
//-----------------------------------------------------------------------------------------------------------------------------------
void DisplayArray(int[] myArray)  //метод выводящий содержимое массива в сторку
{
    System.Console.WriteLine($"[{string.Join(";", myArray)}]"); //крутой метод вывода массива. параметр1-сепаратор, пар2-сам массив
}
//-----------------------------------------------------------------------------------------------------------------------------------
int[] GetArrayFromConsole(string txt)   //возращает массив введеный с консоли ручками
{
Console.Write(txt);
var inputArray = Array.ConvertAll(Console.ReadLine().Split(), int.Parse); //конструкция, позволяет с консоли вводить массив
return inputArray;
}
//-----------------------------------------------------------------------------------------------------------------------------------
bool TriangleCheck(int[] sideArray) //проверка условий задачи, возращает истину, если a+b>c и ложь если не так
{
    if ((sideArray[0]+sideArray[1])>sideArray[2]&& (sideArray[1]+sideArray[2])>sideArray[0]&&(sideArray[0]+sideArray[2])>sideArray[1])
    {return true;} 
    else{return false;}
   
}
//-----------------------------------------------------------------------------------------------------------------------------------
string ValidTriangle(bool triangle)
{
    if(triangle==false){return "треугольник невозможен";}else{return "треугольник возможен";}
}
//-----------------------------------------------------------------------------------------------------------------------------------
void DisplayAll()
{
    var tempArray=GetArrayFromConsole("введите длины: ");
    DisplayArray(tempArray);
    Console.WriteLine(TriangleCheck(tempArray));
    Console.WriteLine(ValidTriangle(TriangleCheck(tempArray)));
}
//-----------------------------------------------------------------------------------------------------------------------------------
DisplayAll();