// Выполнил: Артем Анатольевич Авдеев (know as Survivor of the SAO)
// ______________________________________________________________________________________________________________________________
// Задача 27: Напишите программу, которая принимает на вход число и выдаёт сумму цифр в числе. (число Пифагора)
// 452 -> 11
// 82 -> 10
// 9012 -> 12
//==================================================================================================================================
// Решение:
//-----------------------------------------------------------------------------------------------------------------------------------
string GetString(string t)    // метод считывает строку, при этом выводит задаваемый комментарий на консоль
{
System.Console.Write(t);  //вывод комментария на консоль
return Console.ReadLine(); //вызов метода считывания строки
}
//-----------------------------------------------------------------------------------------------------------------------------------
void DisplayRender(int renderResult)  //метод выводящий содержимое расчета
{
    System.Console.Write($"От Пифагора получите: {renderResult}");
}
//-----------------------------------------------------------------------------------------------------------------------------------
int CharToDigit(char num)  //метод возращающий символ в число
{
    return (int)Char.GetNumericValue(num);  //метод для преобразования числового символа Unicode в его числовой эквивалент (спиз-л из справочника)
}
//-----------------------------------------------------------------------------------------------------------------------------------
int PifagoryanSum(string txt)   //расчет суммы Пифагора
{
    int sumPif=0;
    
    for(int i=0; i<txt.Length; i++)
    {
        sumPif=sumPif+CharToDigit(txt[i]);
    }
    return sumPif;

}
//-----------------------------------------------------------------------------------------------------------------------------------

DisplayRender(PifagoryanSum(GetString("Введите число: ")));
