// На входе некое число N, а на выходе - таблица квадратов чисел от 1 до N

//_____________________________________________________________________________________________________________________________

int InNumber(string txt)   // объявление метода ввода строки и преобразования в целое число
{
    System.Console.Write(txt);
    return Convert.ToInt32(Console.ReadLine());
}
//_____________________________________________________________________________________________________________________________

void ListingTableSQR(int num)   // объявление метода вывода таблицы результатов по условию задачи
{
    System.Console.Write(num +"-> ");
    for(int i=1; i<=num; i++)
    {
        System.Console.Write(Math.Pow(i,2)+"; ");
    }
}

//_____________________________________________________________________________________________________________________________

ListingTableSQR(InNumber("Введите любое целое число:"));
