// Выполнил: Артем Анатольевич Авдеев (know as Survivor of the SAO)
// ______________________________________________________________________________________________________________________________
// Задача 25: Напишите цикл, который принимает на вход два числа (A и B) и возводит число A в натуральную степень B.
// 3, 5 -> 243 (3⁵)
// 2, 4 -> 16
//==================================================================================================================================
// Решение:
//-----------------------------------------------------------------------------------------------------------------------------------
int GetDigitFromString(string txt)    // метод преобразует строку в число, при этом выводит задаваемый комментарий на консоль
{
System.Console.Write(txt);  //вывод комментария на консоль
return Convert.ToInt32(Console.ReadLine()); //вызов метода преобразования строки/целое число
}
//-----------------------------------------------------------------------------------------------------------------------------------
//-----------------------------------------------------------------------------------------------------------------------------------
void DisplayRender(int renderResult)  //метод выводящий содержимое расчета
{
    System.Console.Write($"Результат возведение в степень: {renderResult}");
}
//-----------------------------------------------------------------------------------------------------------------------------------
int RenderFoundToDegree(int found, int degree)  //метод возращающий возведение основания в степень.
{
    int foundDegree=found;
    for(int j=1; j<degree; j++){foundDegree=foundDegree*found;}
    return foundDegree;
}
//-----------------------------------------------------------------------------------------------------------------------------------
DisplayRender(RenderFoundToDegree(GetDigitFromString("Введите основание: "),GetDigitFromString("Введите степень: ")));
