//Выполнил: Артем Авдеев (now as Survivor of the SAO)

//===================================================================================================================================
// Задача 19
// Напишите программу, которая принимает на вход пятизначное число и проверяет, является ли оно палиндромом.
// 14212 -> нет
// 12821 -> да
// 23432 -> да
//----------------------------------------------------------------------------------------------------------------------------------
//Решение: я не совсем оптимальный код написал, потому-что старался по-больше разных методов использовать, но все работает!
//_____________________________________________________________________________________________________________________________

int InNumber(string txt)   // объявление метода ввода строки и преобразования в целое число
{
    return Convert.ToInt32(txt);
}
//_____________________________________________________________________________________________________________________________

bool x5integer(int numer)   // объявление метода проверки: истина-5значное/ложь-иная разрядность
{
    if(numer>9999 && numer<100000) {return true;}
    else {return false;}
}
//_____________________________________________________________________________________________________________________________

bool PalindromingResult(string digit) //метод оценки палиндромности 5-значного числа(вот - загнул!)
{
    if(digit[0]==digit[4] && digit[1]==digit[3]) {return true;}
    else {return false;}
}
// _____________________________________________________________________________________________________________________________

void PrintAnalisResult(string count, bool palindrom)  //метод вывода с проверкой результата палиндромности
{
    System.Console.Write("Чило: "+count);
       
    if (palindrom==true){System.Console.Write(" - палиндром!!!");}
    else {System.Console.Write(" - непалиндром");}
}
    
// _____________________________________________________________________________________________________________________________

System.Console.Write("Введите пятизначное целое число: ");
string inputData=System.Console.ReadLine();
bool i=false;   //переменная для проверки
if (i==x5integer(InNumber(inputData))){System.Console.Write("Это не пятизначное чило!");}
else {PrintAnalisResult(inputData,PalindromingResult(inputData));}
