//Выполнил: Артем Анатольевич Авдеев (know as Survivor of the SAO)
//___________________________________________________________________________________________________________________________________
// Задача 36: Задайте одномерный массив, заполненный случайными числами. Найдите сумму элементов, стоящих на нечётных позициях.
// [3, 7, 23, 12] -> 19
// [-4, -6, 89, 6] -> 0
//===================================================================================================================================
// Решение:
int GetDigitString(string txt)    // метод преобразует строку в число, при этом выводит задаваемый комментарий на консоль
{
System.Console.Write(txt);  //вывод комментария на консоль
return Convert.ToInt32(Console.ReadLine()); //вызов метода преобразования строки/целое число
}
//-----------------------------------------------------------------------------------------------------------------------------------
int [] GeneratingRandomValuesFillingArray(int sizeArray,int lowRND,int hightRND)    //объединяющий метод - создания массива по условию задачи
{
    var varArray = new int [sizeArray];   //создание массива заданной длины
    var randomValue = new Random(); //объявление рандомной переменной

    for (int i=0; i<varArray.Length; i++)            //заполнение массива случайными значениями
        {
            varArray[i]=randomValue.Next(lowRND,hightRND+1); //вниманиt!: значение правого диапазона невходит, поэтому:(n+1)
        }
    return varArray;
}
//-----------------------------------------------------------------------------------------------------------------------------------
int SumOddNumbersByArray(int [] sourceArray)   //подсчет суммы чисел, стоящих на нечетных позициях: index=1,3,5...
{
    int sumOddNumbers=0; //аккамулятор суммы
    for(int i=1; i<sourceArray.Length;i=i+2){sumOddNumbers=sumOddNumbers+sourceArray[i];}
    return sumOddNumbers;
}
//-----------------------------------------------------------------------------------------------------------------------------------
void DisplayArray (int [] myArray)  //метод выводящий содержимое массива в сторку
{
    System.Console.WriteLine($"[{string.Join(";",myArray)}]"); //крутой метод вывода массива. параметр1-сепаратор, пар2-сам массив
}
//-----------------------------------------------------------------------------------------------------------------------------------
void DisplayAll()   //демонстрация всех условий и значений
{
    int [] tempArray=GeneratingRandomValuesFillingArray(GetDigitString("Введите длину массива: "),-100,100);
    
    DisplayArray(tempArray);
 
    System.Console.WriteLine($"Сумма элементов массива на нечетных позициях: {SumOddNumbersByArray(tempArray)}");
}
//-----------------------------------------------------------------------------------------------------------------------------------

DisplayAll();   //по сути - запуск проги