//Выполнил: Артем Авдеев (know as Survivor of the SAO)

// Задача 23
// Напишите программу, которая принимает на вход число (N) и выдаёт таблицу кубов чисел от 1 до N.
// 3 -> 1, 8, 27
// 5 -> 1, 8, 27, 64, 125
//-----------------------------------------------------------------------------------------------------------------
//Решение:

int InNumber(string txt)   // объявление метода ввода строки и преобразования в целое число
{
    System.Console.Write(txt);
    return Convert.ToInt32(Console.ReadLine());
}
//_____________________________________________________________________________________________________________________________

void ListingTableCubes(int num)   // объявление метода вывода таблицы результатов по условию задачи
{
    System.Console.Write(num +"-> ");
    for(int i=1; i<=num; i++)
    {
        System.Console.Write(Math.Pow(i,3)+"; ");
    }
}

//_____________________________________________________________________________________________________________________________

ListingTableCubes(InNumber("Введите любое целое число:"));