//by Survivor of the SAO
//___________________________________________________________________________________________________________________________________
//Задача 42: перевести 10-чное число в 2-ичное
//===================================================================================================================================
//-----------------------------------------------------------------------------------------------------------------------------------
int GetDigitString(string txt)    // метод преобразует строку в число, при этом выводит задаваемый комментарий на консоль
{
System.Console.Write(txt);  //вывод комментария на консоль
return Convert.ToInt32(Console.ReadLine()); //вызов метода преобразования строки/целое число
}
//-----------------------------------------------------------------------------------------------------------------------------------
string ConvertDecToBinar(int decil) //даем целое десятичное число, на выходе двоичное (бинарное)
{
   return Convert.ToString(decil, 2);   //конвертируем число в строку, где "2" - указатель на двоичное представление
}
//-----------------------------------------------------------------------------------------------------------------------------------
Console.WriteLine($"Двоичное значение: {ConvertDecToBinar(GetDigitString("Введите число: "))}");
