//Выполнил: Артем Анатольевич Авдеев (know as Survivor of the SAO & Master of the Geass)
//___________________________________________________________________________________________________________________________________
// Задача 66: Задайте значения M и N. Напишите программу, которая найдёт сумму натуральных элементов в промежутке от M до N.
// M = 1; N = 15 -> 120
// M = 4; N = 8. -> 30
//===================================================================================================================================
//Решение:
//-----------------------------------------------------------------------------------------------------------------------------------
int GDS(string txt)    // метод преобразует строку в число, при этом выводит задаваемый комментарий на консоль
{
    System.Console.Write(txt);  //вывод комментария на консоль
    return Convert.ToInt32(Console.ReadLine()); //вызов метода преобразования строки/целое число
}
//-----------------------------------------------------------------------------------------------------------------------------------
int SummDiapason(int minD, int maxD)//метод возращающий сумму натуральных чисел, лежащих в задаваемом диапазоне 
{
    if (maxD < minD) {return 0; }
    return maxD + SummDiapason(minD, maxD - 1);
}
//-----------------------------------------------------------------------------------------------------------------------------------
void DisplayAll()
{
    System.Console.WriteLine();
    System.Console.WriteLine($"Сумма чисел между элементами = {SummDiapason(GDS("Введите минимальное значение: "), GDS("Введите максимальное значение: "))}");
    System.Console.WriteLine();
}
//-----------------------------------------------------------------------------------------------------------------------------------

DisplayAll();