// Задача 24: На воде число А, а на выходе сумма чисел от 1 до А
//-------------------------------------------------------------------------------------------------------------------------------
int GetDigit(string txt)    // метод берет и выводит стоку (см.ср.9) и возращает целое число с консоли
{
System.Console.Write(txt);
return Convert.ToInt32(Console.ReadLine());
}
//--------------------------------------------------------------------------------------------------------------------------------   
//   int SumResult (int num)     //метод принимающий число А и возращающий сумму, по условию задачи
// {
//     int result = 0;
//     for(int i=1; i <= num; i++ ) {result +=i;}
//     return result;
// }
// //--------------------------------------------------------------------------------------------------------------------------------
// System.Console.WriteLine($"Результат суммы от 1 до A: {SumResult(GetDigit("Введите целое цисло А: "))}");

//===================================================================================================================================
// Задача 26: На воде число , а на выходе - количество цифр в числе + Задача 28: Расчет факториала
//-------------------------------------------------------------------------------------------------------------------------------
int NumberOfDigits(string txt)  //метод опреледеления разрядности числа
{
    int numbers=txt.Length; return numbers;
}
//-------------------------------------------------------------------------------------------------------------------------------
string GetString(string txt)    // метод берет и выводит стоку, затем возращает введенную строку с консоли
{
System.Console.Write(txt);
return Convert.ToString(Console.ReadLine());
}
//-------------------------------------------------------------------------------------------------------------------------------
int Factorial(int n)     //метод вычисления факториала
{
    int m=1;
    for(int l=1; l<=n; l++){m=m*l;}
    return m;
}
//-------------------------------------------------------------------------------------------------------------------------------

System.Console.WriteLine($"Количество цифр в числе: {NumberOfDigits(GetString("Введите целое цисло: "))}");
System.Console.WriteLine($"Факториал числа будет: {Factorial(GetDigit("Введите целое цисло для расчета факториала: "))}");
