//by Survivor of the SAO
//___________________________________________________________________________________________________________________________________
//Задача 44: Выдавать числа Фибоначи заданное количество (в N)
//===================================================================================================================================
//-----------------------------------------------------------------------------------------------------------------------------------
int GetDigitString(string txt)    // метод преобразует строку в число, при этом выводит задаваемый комментарий на консоль
{
    System.Console.Write(txt);  //вывод комментария на консоль
    return Convert.ToInt32(Console.ReadLine()); //вызов метода преобразования строки/целое число
}
//-----------------------------------------------------------------------------------------------------------------------------------
int[] FibonachiDigits(int num)  //метод возращает в массиве сгенерированные числа Фибоначи, в количестве, заданным пользователем
{
    var fibArray = new int [num];
    fibArray[0]=0;
    fibArray[1]=1;
    for(int i=2; i<fibArray.Length;i++)
    {
        fibArray[i]=fibArray[i-1]+fibArray[i-2];
    }
    return fibArray;
}
//-----------------------------------------------------------------------------------------------------------------------------------
void DisplayArray (int [] myArray)  //метод выводящий содержимое массива в сторку
{
    System.Console.WriteLine($"[{string.Join(";",myArray)}]"); //крутой метод вывода массива. параметр1-сепаратор, пар2-сам массив
}
//-----------------------------------------------------------------------------------------------------------------------------------

DisplayArray(FibonachiDigits(GetDigitString("Сколько чисел Фиббоначи показать?: ")));